test_old/multiphaseEuler/populationBalance/isothermalGrowth/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc residuals
(
    p_rgh,
    f3.air1.bubbles,
    f9.air2.bubbles,
    f15.air3.bubbles
)
#includeFunc graphCell
(
    name=graph,
    start=(0.05 0 0.05),
    end=(0.05 1.0 0.05),
    axis=y,
    d.bubbles,
    p,
    alpha.air1,
    alpha.air2,
    alpha.air3,
    alpha.bubbles
)
#includeFunc cellZoneAverage
#includeFunc writeObjects(d.air1)
#includeFunc writeObjects(d.air2)
#includeFunc writeObjects(d.air3)

// ************************************************************************* //
